var week = new Array(
  "일요일",
  "월요일",
  "화요일",
  "수요일",
  "목요일",
  "금요일",
  "토요일"
);

const a_timeline = new Array(
  485,
  505,
  525,
  570,
  605,
  625,
  645,
  680,
  760,
  785,
  805,
  825,
  870,
  905,
  925,
  945,
  990,
  1020,
  1040,
  1060,
  1080,
  1100,
  1120,
  1200
);

var a_location = new Array(
  "정문",
  "약학대학",
  "해대 1호관",
  "본관",
  "학생회관",
  "인문대 서쪽",
  "학생생활관",
  "인문대 동쪽",
  "중앙도서관",
  "의과대학",
  "공대 4호관",
  "교양동"
);

var b_timeline = new Array(
  490,
  510,
  530,
  580,
  610,
  630,
  650,
  690,
  770,
  790,
  810,
  830,
  880,
  910,
  930,
  950,
  1000,
  1030,
  1050,
  1070,
  1090,
  1110,
  1130,
  1200
);

var b_location = new Array(
  "정문",
  "약학대학",
  "해대 1호관",
  "교양동",
  "공대 4호관",
  "의과대학",
  "중앙도서관",
  "인문대 동쪽",
  "학생생활관",
  "인문대 서쪽",
  "학생회관",
  "본관"
);

var night_timeline = new Array(
  1200,
  1220,
  1240,
  1260,
  1280,
  1300,
  1320,
  1340,
  1360,
  1380
);
